/*
       Webpage: https://mawdoo3.com/أحاديث_عن_الصيام
*/
let title = "الصيام ورمضان";

messages.push(
       MorningEveningMessage(
              title,
              "كُلُوا وَاشْرَبُوا حَتَّىٰ يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ(1)*",
              0,
              0,
              0,
              [
                     "البقرة: الدليل على وجوب الإمساك عن المفطرات"
              ],
              "",
              false,
              true,
              187
       )
);

messages.push(new Message(title, 'حديث عمر بن الخطاب رَضِيَ اللهُ عَنْهُ قال: سمعت رسول الله- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- يقول:" إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ"', undefined, ""));
messages.push(new Message(title, 'عن أبي هريرة- رَضِيَ اللهُ عَنْهُ- قال: جَاءَ رَجُلٌ إِلَى النَّبِيِّ- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-، فَقَالَ: هَلَكْتُ، يَا رَسُولَ اللَّهِ، قَالَ: وَمَا أَهْلَكَكَ؟ قَالَ: وَقَعْتُ عَلَى امْرَأَتِي فِي رَمَضَانَ، قَالَ: هَلْ تَجِدُ مَا تُعْتِقُ رَقَبَةً؟ قَالَ: لَا، قَالَ: فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ؟ قَالَ: لَا، قَالَ: فَهَلْ تَجِدُ مَا تُطْعِمُ سِتِّينَ مِسْكِينًا؟ قَالَ: لَا، قَالَ: ثُمَّ جَلَسَ، فَأُتِيَ النَّبِيُّ- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- بِعَرَقٍ فِيهِ تَمْرٌ، فَقَالَ: تَصَدَّقْ بِهَذَا قَالَ: أَفْقَرَ مِنَّا؟ فَمَا بَيْنَ لَابَتَيْهَا أَهْلُ بَيْتٍ أَحْوَجُ إِلَيْهِ مِنَّا، فَضَحِكَ النَّبِيُّ- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- حَتَّى بَدَتْ أَنْيَابُهُ، ثُمَّ قَالَ: اذْهَبْ فَأَطْعِمْهُ أَهْلَكَ', undefined, ""));



messages.push(new Message(title, "مَن صَامَ رَمَضَانَ، إيمَانًا واحْتِسَابًا، غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ(1)", undefined, "", ["رواه البخاري، في صحيح البخاري، عن أبي هريرة ، الصفحة أو الرقم: 38، 38"]));
messages.push(new Message(title, "مَن صامَ رَمَضانَ ثُمَّ أتْبَعَهُ سِتًّا مِن شَوَّالٍ، كانَ كَصِيامِ الدَّهْرِ(1)", undefined, "", ["رواه مسلم، في صحيح مسلم، عن أبي أيوب الأنصاري، الصفحة أو الرقم: 1164، صحيح"]));
messages.push(new Message(title, "بُنِيَ الإسْلامُ علَى خَمْسٍ، شَهادَةِ أنْ لا إلَهَ إلَّا اللَّهُ، وأنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ، وإقامِ الصَّلاةِ، وإيتاءِ الزَّكاةِ، وحَجِّ البَيْتِ، وصَوْمِ رَمَضانَ(1)", undefined, "", ["رواه مسلم، في صحيح مسلم، عن عبدالله بن عمر، الصفحة أو الرقم: 16، صحيح"]));


messages.push(new Message(title, "أُنزِلَت صحُفُ إبراهيمَ أولَ ليلةٍ من رمضانَ ، و أُنزلَت التوراةُ لستٍّ مَضَين من رمضانَ ، و أُنزِلَ الإنجيلُ لثلاثِ عشرةَ ليلةً خلَتْ من رمضانَ ، و أُنزلَ الزَّبورُ لثمانِ عشرةَ خلَتْ من رمضانَ ، و أُنزِلَ القرآنُ لأربعٍ و عشرين خلَتْ من رمضانَ(1)", undefined, "", ["رواه الألباني، في الألباني، عن واثلة بن الأسقع الليثي أبو فسيلة، الصفحة أو الرقم: واثلة بن الأسقع الليثي أبو فسيلة، إسناده حسن"]));
messages.push(new Message(title, "إذا جاءَ رَمَضانُ فُتِّحَتْ أبْوابُ الجَنَّةِ، وغُلِّقَتْ أبْوابُ النَّارِ، وصُفِّدَتِ الشَّياطِينُ(1)", undefined, "", ["رواه أبو هريرة ، في صحيح مسلم، عن مسلم، الصفحة أو الرقم: 1079 ، صحيح"]));
messages.push(new Message(title, "إنَّ للهِ تبارك و تعالى عُتقاءَ في كلِّ يومٍ و ليلةٍ - يعني في رمضانَ - . و إنَّ لكلِّ مسلمٍ في كلِّ يومٍ و ليلةٍ دعوةٌ مُستجابةٌ(1)", undefined, "", ["رواه الألباني، في صحيح الترغيب، عن أبو سعيد الخدري، الصفحة أو الرقم: 1002، صحيح لغيره"]));
messages.push(new Message(title, "الصلاةُ المكتوبةُ إلى الصلاةِ التي بعدَها كفارةٌ لما بينهما قال والجمعةُ إلى الجمعةِ والشهرُ إلى الشهرِ يعني رمضانَ إلى رمضانَ كفارةٌ لما بينهما(1)", undefined, "", ["رواه أحمد شاكر، في مسند أحمد، عن أبو هريرة، الصفحة أو الرقم: 12/99، إسناده صحيح"]));
messages.push(new Message(title, "إذا جاءَ رمضانُ فُتِّحَت أبوابُ الجنَّةِ ، وغُلِّقَت أبوابُ النَّارِ وصُفِّدَتِ الشَّياطينُ(1)", undefined, "", ["رواه الهيتمي المكي ، في الزواجر، عن أبي هريرة ، الصفحة أو الرقم: 1/198، صحيح أو حسن"]));
messages.push(new Message(title, "إذا كان أولُ ليلةٍ من رمضانَ صُفِّدَتِ الشياطينُ مَرَدَةُ الجِنِّ، وغُلِّقَتْ أبوابُ النارِ، فلم يُفْتَحْ منها بابٌ، وفُتِّحَتْ أبوابُ الجِنانِ فلم يُغْلَقْ منها بابٌ، ونادَى مُنادٍ يا باغِيَ الخيرِ أَقْبِلْ، ويا باغِيَ الشَّرِّ أَقْصِرْ، وللهِ عُتَقاءُ من النارِ(1)", undefined, "", ["رواه الألباني، في صحيح ابن خزيمة، عن أبي هريرة، الصفحة أو الرقم: 1883 ، إسناده حسن"]));



messages.push(new Message(title, "الصيامُ والقُرآنُ يَشفَعانِ للعَبدِ؛ يقولُ الصيامُ: ربِّ، إنِّي منَعْتُه الطعامَ والشَّهَواتِ بالنَّهارِ فشَفِّعْني فيه، ويقولُ القُرآنُ: منَعْتُه النومَ باللَّيلِ فيُشَفَّعانِ(1)", undefined, "", ["رواه شعيب الأرناؤوط، في تخريج سير أعلام النبلاء، عن عبدالله بن عمرو ، الصفحة أو الرقم: 12/22، صحيح"]));
messages.push(new Message(title, "كُلُّ عَمَلِ ابْنِ آدَمَ له إلَّا الصَّوْمَ، فإنَّه لي وأنا أجْزِي به، ولَخُلُوفُ فَمِ الصَّائِمِ أطْيَبُ عِنْدَ اللَّهِ مِن رِيحِ المِسْكِ(1)", undefined, "", ["رواه البخاري، في صحيح البخاري، عن أبي هريرة ، الصفحة أو الرقم: 5927 ، صحيح"]));
messages.push(new Message(title, "الصِّيَامُ جُنَّةٌ(1)", undefined, "", ["رواه مسلم، في صحيح مسلم، عن أبي هريرة، الصفحة أو الرقم: 1151 ، صحيح."]));
messages.push(new Message(title, "كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ، الحَسَنَةُ عَشْرُ أَمْثَالِهَا إلى سَبْعمِئَة ضِعْفٍ، قالَ اللَّهُ عَزَّ وَجَلَّ: إلَّا الصَّوْمَ، فإنَّه لي وَأَنَا أَجْزِي به، يَدَعُ شَهْوَتَهُ وَطَعَامَهُ مِن أَجْلِي لِلصَّائِمِ فَرْحَتَانِ: فَرْحَةٌ عِنْدَ فِطْرِهِ، وَفَرْحَةٌ عِنْدَ لِقَاءِ رَبِّهِ وَلَخُلُوفُ فيه أَطْيَبُ عِنْدَ اللهِ مِن رِيحِ المِسْكِ(1)", undefined, "", ["رواه مسلم، في صحيح مسلم، عن أبي هريرة، الصفحة أو الرقم: 1151، صحيح"]));
messages.push(new Message(title, "فِي الجَنَّةِ ثَمَانِيَةُ أبْوَابٍ، فِيهَا بَابٌ يُسَمَّى الرَّيَّانَ، لا يَدْخُلُهُ إلَّا الصَّائِمُونَ(1)", undefined, "", ["رواه البخاري، في صحيح البخاري، عن سهل بن سعد الساعدي، الصفحة أو الرقم: 3257 ، صحيح"]));
messages.push(new Message(title, "من صام ثلاثةَ أيامٍ من كلِّS شهرٍ فقد صام الدهرَ(1)", undefined, "", ["رواه محمد جار الله الصعدي ، في النوافح العطرة، عن أبي ذر الغفاري، الصفحة أو الرقم: 388 ، صحيح"]));
messages.push(new Message(title, "ثلاثةٌ لا تُردُّ دعوتُهم الصَّائمُ حين يُفطرُ والإمامُ العادلُ ودعوةُ المظلومِ يرفعُها اللهُ فوق الغمامِ وتُفتَّحُ لها أبوابُ السَّماءِ ويقولُ الرَّبُّ وعزَّتي وجلالي لأنصرَنَّك ولو بعد حينٍ(1)", undefined, "", ["رواه المنذري، في الترغيب والترهيب، عن أبي هريرة، الصفحة أو الرقم: 2/111، صحيح أو حسن"]));
messages.push(new Message(title, "مَن صامَ يَوْمًا في سَبيلِ اللَّهِ، بَعَّدَ اللَّهُ وجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا(1)", undefined, "", ["رواه البخاري، في صحيح البخاري، عن أبو سعيد الخدري، الصفحة أو الرقم: أبو سعيد الخدري، صحيح"]));
messages.push(new Message(title, "بَلَغَنِي أنَّكَ تَصُومُ النَّهارَ وتَقُومُ اللَّيْلَ، فلا تَفْعَلْ، فإنَّ لِجَسَدِكَ عَلَيْكَ حَظًّا، ولِعَيْنِكَ عَلَيْكَ حَظًّا، وإنَّ لِزَوْجِكَ عَلَيْكَ حَظًّا، صُمْ وأَفْطِرْ، صُمْ مِن كُلِّ شَهْرٍ ثَلاثَةَ أيَّامٍ، فَذلكَ صَوْمُ الدَّهْرِ قُلتُ: يا رَسولَ اللهِ، إنَّ بي قُوَّةً، قالَ: فَصُمْ صَوْمَ داوُدَ عليه السَّلام، صُمْ يَوْمًا وأَفْطِرْ يَوْمًا. فَكانَ يقولُ: يا لَيْتَنِي أخَذْتُ بالرُّخْصَةِ(1)", undefined, "", ["رواه مسلم ، في صحيح مسلم ، عن عبدالله بن عمرو، الصفحة أو الرقم: 1159 ، صحيح"]));




